{
    "lang_title": "Calculadora de Amanecer y Atardecer", 
    "lang_instructions": "¡Bienvenido al Calculador de Amanecer y Atardecer! Descubre las horas de amanecer y atardecer para cualquier lugar en la Tierra. Para seleccionar un lugar, simplemente ingresa la ciudad y el país en el cuadro de texto a continuación y presiona 'Calcular'. Alternativamente, haz clic directamente en el globo para una selección precisa. Después de elegir un lugar, puedes seleccionar una fecha para ver las horas correspondientes de amanecer y atardecer.",
    "lang_globe_instructions": "Selecciona y haz clic en un lugar en el globo:",
    "lang_OR": "O",
    "lang_location_search": "Ingrese la ubicación (Ciudad, País):",
    "lang_calculate": "Calcular",
    "lang_reset": "Restablecer",
    "lang_results": "Resultados",
    "lang_current_time": "Hora Actual (Local):",
    "lang_date_selection": "Seleccione la fecha a ver",
    "lang_sunrise_time": "Hora del amanecer:",
    "lang_sunset_time": "Hora del atardecer:",
    "lang_timezone": "Zona Horaria:",
    "lang_asked_questions": "Preguntas Frecuentes",
    "lang_question1": "¿Cómo se calcula la hora local?",
    "lang_answer1": "La hora local se calcula utilizando la API de zona horaria de Google, basada en las coordenadas geográficas de la ubicación ingresada.",
    "lang_question2": "¿Qué ubicaciones puedo buscar?",
    "lang_answer2": "Puede buscar cualquier ciudad y país a nivel mundial.",
    "lang_question3": "¿Por qué no aparece mi ubicación?",
    "lang_answer3": "Asegúrese de ingresar tanto la ciudad como el país para obtener los mejores resultados.",
    "lang_question4": "¿Qué es el atardecer?",
    "lang_answer4": "El momento del día cuando el Sol desaparece, descendiendo por debajo del horizonte de la Tierra.",
    "lang_question5": "¿Qué es el amanecer?",
    "lang_answer5": "El momento del día cuando el Sol aparece, ascendiendo por encima del horizonte de la Tierra.",
    "lang_privacy_statement": "© 2024 Calculadora de Amanecer y Atardecer. Todos los derechos reservados.",
    "lang_contact_info": "Contáctenos",
    "lang_tooltip_text": "Use esta calculadora para encontrar la hora local y la zona horaria según la ubicación ingresada o haciendo clic en el globo terráqueo.",
    "lang_error_location": "No se ha encontrado la ubicación para \"{0}\". Por favor, pruebe con otra ciudad.",
    "lang_error_invalidLocation": "Por favor, introduzca una ubicación válida.",
    "lang_error_fetchTime": "Error al obtener los datos de la hora local.",
    "lang_error_fetchSunTime": "Error al obtener los horarios de salida y puesta del sol.",
    "lang_error_retrieveSunTime": "No se pueden recuperar los horarios de salida y puesta del sol."
}
