{
    "lang_title": "Calculateur de lever et de coucher du soleil", 
    "lang_instructions": "Bienvenue dans le calculateur des heures de lever et de coucher du soleil ! Découvrez les heures de lever et de coucher du soleil pour n'importe quel endroit sur Terre. Pour sélectionner un lieu, entrez simplement la ville et le pays dans la zone de texte ci-dessous et appuyez sur 'Calculer'. Sinon, vous pouvez cliquer directement sur le globe pour une sélection précise. Après avoir choisi un lieu, vous pouvez sélectionner une date pour voir les heures de lever et de coucher du soleil correspondantes.",
    "lang_globe_instructions": "Sélectionnez et cliquez sur un emplacement sur le globe :",
    "lang_OR": "OU",
    "lang_location_search": "Entrez l'emplacement (Ville, Pays) :",
    "lang_calculate": "Calculer",
    "lang_reset": "Réinitialiser",
    "lang_results": "Résultats",
    "lang_current_time": "Heure actuelle (Locale) :",
    "lang_date_selection": "Sélectionnez la date à afficher",
    "lang_sunrise_time": "Lever du soleil :",
    "lang_sunset_time": "Coucher du soleil :",
    "lang_timezone": "Fuseau horaire :",
    "lang_asked_questions": "Questions Fréquemment Posées",
    "lang_question1": "Comment l'heure locale est-elle calculée ?",
    "lang_answer1": "L'heure locale est calculée à l'aide de l'API de fuseau horaire de Google en fonction des coordonnées géographiques de l'emplacement saisi.",
    "lang_question2": "Quels emplacements puis-je rechercher ?",
    "lang_answer2": "Vous pouvez rechercher n'importe quelle ville et pays dans le monde.",
    "lang_question3": "Pourquoi mon emplacement n'apparaît-il pas ?",
    "lang_answer3": "Assurez-vous de saisir à la fois la ville et le pays pour de meilleurs résultats.",
    "lang_question4": "Qu'est-ce que le coucher du soleil ?",
    "lang_answer4": "Le moment de la journée où le Soleil disparaît en dessous de l'horizon terrestre.",
    "lang_question5": "Qu'est-ce que le lever du soleil ?",
    "lang_answer5": "Le moment de la journée où le Soleil apparaît au-dessus de l'horizon terrestre.",
    "lang_privacy_statement": "© 2024 Calculateur de lever et de coucher du soleil. Tous droits réservés.",
    "lang_contact_info": "Nous contacter",
    "lang_tooltip_text": "Utilisez ce calculateur pour trouver l'heure locale et le fuseau horaire en fonction de l'emplacement saisi ou en cliquant sur le globe.",
    "lang_error_location": "Emplacement non trouvé pour \"{0}\". Veuillez essayer avec une autre ville.",
    "lang_error_invalidLocation": "Veuillez entrer un emplacement valide.",
    "lang_error_fetchTime": "Échec de la récupération des données de l'heure locale.",
    "lang_error_fetchSunTime": "Échec de la récupération des heures de lever et de coucher du soleil.",
    "lang_error_retrieveSunTime": "Impossible de récupérer les heures de lever et de coucher du soleil."
}
    
