{
    "lang_title": "Máy Tính Thời Gian Mặt Trời Mọc và Lặn",
    "lang_instructions": "Chào mừng đến với Máy tính Giờ Mặt trời mọc và Mặt trời lặn! Khám phá giờ mặt trời mọc và mặt trời lặn cho bất kỳ địa điểm nào trên Trái Đất. Để chọn một địa điểm, hãy nhập tên thành phố và quốc gia vào hộp văn bản bên dưới và nhấn 'Tính toán'. Hoặc, bạn cũng có thể nhấp trực tiếp vào quả địa cầu để chọn chính xác. Sau khi chọn địa điểm, bạn có thể chọn một ngày để xem giờ mặt trời mọc và mặt trời lặn tương ứng.",
    "lang_globe_instructions": "Chọn và nhấp vào một địa điểm trên quả địa cầu:",
    "lang_OR": "HOẶC",
    "lang_location_search": "Nhập Vị Trí (Thành phố, Quốc gia):",
    "lang_calculate": "Tính Toán",
    "lang_reset": "Đặt Lại",
    "lang_results": "Kết Quả",
    "lang_current_time": "Giờ Hiện Tại (Địa Phương):",
    "lang_date_selection": "Chọn ngày để xem",
    "lang_sunrise_time": "Mặt Trời Mọc:",
    "lang_sunset_time": "Mặt Trời Lặn:",
    "lang_timezone": "Múi Giờ:",
    "lang_asked_questions": "Câu Hỏi Thường Gặp",
    "lang_question1": "Làm thế nào để tính giờ địa phương?", 
    "lang_answer1": "Giờ địa phương được tính bằng cách sử dụng API Múi Giờ của Google dựa trên tọa độ địa lý của vị trí bạn đã nhập.",
    "lang_question2": "Tôi có thể tìm kiếm vị trí nào?",
    "lang_answer2": "Bạn có thể tìm kiếm bất kỳ thành phố và quốc gia nào trên toàn cầu.",
    "lang_question3": "Tại sao vị trí của tôi không hiển thị?",
    "lang_answer3": "Hãy chắc chắn nhập cả tên thành phố và quốc gia để có kết quả tốt nhất.",
    "lang_question4": "Hoàng hôn là gì?",
    "lang_answer4": "Thời điểm trong ngày khi Mặt Trời biến mất, hạ xuống dưới đường chân trời của Trái Đất.",
    "lang_question5": "Bình minh là gì?",
    "lang_answer5": "Thời điểm trong ngày khi Mặt Trời xuất hiện, lên trên đường chân trời của Trái Đất.",
    "lang_privacy_statement": "© 2024 Máy Tính Thời Gian Mặt Trời Mọc và Lặn. Bảo Lưu Mọi Quyền.",
    "lang_contact_info": "Liên Hệ Chúng Tôi",
    "lang_tooltip_text": "Sử dụng máy tính này để tìm giờ địa phương và múi giờ dựa trên vị trí đã nhập hoặc bằng cách nhấp vào quả địa cầu.",
    "lang_error_location": "Không tìm thấy vị trí cho \"{0}\". Vui lòng thử thành phố khác.",
    "lang_error_invalidLocation": "Vui lòng nhập một địa điểm hợp lệ.",
    "lang_error_fetchTime": "Không thể lấy dữ liệu thời gian địa phương.",
    "lang_error_fetchSunTime": "Không thể lấy thời gian mặt trời mọc và lặn.",
    "lang_error_retrieveSunTime": "Không thể truy xuất thời gian mặt trời mọc và lặn."
}
